In [1]:
import pandas as pd
import numpy as np

In [3]:
data = {'name': ['Anastasia', 'Paul', 'Kathe', 'Joseph', 'Linda', 'Michael', 'Matt', 'Laurentine', 'Chirstian', 'Jonas'],
        'score': [12.5, 10, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
assessment_results = pd.DataFrame(data, index=labels)
assessment_results

         name  score  attempts qualify
a   Anastasia   12.5         1     yes
b        Paul   10.0         3      no
c       Kathe   16.5         2     yes
d      Joseph    NaN         3      no
e       Linda    9.0         2      no
f     Michael   20.0         3     yes
g        Matt   14.5         1     yes
h  Laurentine    NaN         1      no
i   Chirstian    8.0         2      no
j       Jonas   19.0         1     yes

Task 8

In [10]:
assessment_results.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Paul   10.0         3      no
c      Kathe   16.5         2     yes

Task 9

In [4]:
assessment_results[assessment_results['attempts'] > 2]

      name  score  attempts qualify
b     Paul   10.0         3      no
d   Joseph    NaN         3      no
f  Michael   20.0         3     yes

Task 10

In [5]:
rows = len(assessment_results.axes[0])
cols = len(assessment_results.axes[1])
print(f"Rows = {rows}")
print(f"Cols = {cols}")

Rows = 10
Cols = 4

Task 11

In [9]:
selected = assessment_results[assessment_results['score'].between(14, 20, inclusive="both")]
selected

      name  score  attempts qualify
c    Kathe   16.5         2     yes
f  Michael   20.0         3     yes
g     Matt   14.5         1     yes
j    Jonas   19.0         1     yes

Task 12

In [19]:
assessment_results.loc['c', 'score'] = 11.5
assessment_results

         name  score  attempts qualify
a   Anastasia   12.5         1     yes
b        Paul   10.0         3      no
c       Kathe   11.5         2     yes
d      Joseph    NaN         3      no
e       Linda    9.0         2      no
f     Michael   20.0         3     yes
g        Matt   14.5         1     yes
h  Laurentine    NaN         1      no
i   Chirstian    8.0         2      no
j       Jonas   19.0         1     yes

Task 13

In [20]:
mean = assessment_results.groupby('name')['score'].mean()
mean

name
Anastasia     12.5
Chirstian      8.0
Jonas         19.0
Joseph         NaN
Kathe         11.5
Laurentine     NaN
Linda          9.0
Matt          14.5
Michael       20.0
Paul          10.0
Name: score, dtype: float64